WEB SCRAPING - ASSIGNMENT 2

Eithar Elfatih Burie Abelrahman Batch DS 2403

In [2]:
import selenium 
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

________________________________

Q1: In this question you have to scrape data using the filters available on the webpage You have to use the location and salary filter.

i was unable to access this website. i have written the steps i would have followed.

In [723]:
#initiate automated Chrome 
driver=webdriver.Chrome()

In [724]:
#open naukri website
driver.get('https://www.naukri.com/')

In [725]:
#enter 'Data Scientist' in correct designation
designation_1=driver.find_element(By.CLASS_NAME, 'suggestor-input')
designation_1.send_keys('Data Scientist')

In [726]:
# click search button
search_1=driver.find_element(By.CLASS_NAME, 'qsbSubmit')
search_1.click()

In [ ]:
# check 3-6lakhs salry filter
salary_checkbox1=driver.find_element(By.CLASS_NAME, '')
salary_checkbox1.click()

In [ ]:
# check Delhi/NDR location filter
location_checkbox1=driver.find_element(By.CLASS_NAME, '')
location_checkbox1.click()

In [718]:
#create list object for each 
job_title_1=[]
job_location_1=[]
company_name_1=[]
experience_required_1=[]

In [ ]:
#scrap require job details
title_tags=driver.find_elements(By.XPATH, "//a[@class='title ']")
for title in title_tags:
    title=title.text
    job_title_1.append(title)
    

location_tag=driver.find_elements(By.XPATH, "//span[@class='locWdth']")
for location in location_tag:
    location=location.text
    job_location_1.append(location)    

    
company_tag=driver.find_elements(By.XPATH, "//div[@class='jobCard_jobCard_cName__mYnow']")
for company in company_tag:
    company=company.text
    company_name_1.append(company)
    
    
experience_tag=driver.find_elements(By.XPATH, "//span[@class='expwdth']")
for experience in experience_tag:
    experience=experience.text
    experience_required_1.append(experience)

In [ ]:
#check length of all details are equal for Dataframe to be created 
print(len(job_title_1),len(job_location_1), len(company_name_1), len(experience_required_1)

In [ ]:
#create Dataframe and correct index 
df_1=pd.DataFrame({'Job Title':job_title_1, 'Location': job_location_1, 'Company' :company_name_1, 'Experience Required' : experience_required_1}) [:10]
df_1.index=df_1.index + 1 
df_1

____________________

Q2: Write a python program to scrape data for ‚ÄúData Scientist‚Äù Job position in ‚ÄúBangalore‚Äù location. You have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data. 
 This task will be done in following steps: 
 1. First get the webpage https://www.shine.com/ 
 2. Enter ‚ÄúData Analyst‚Äù in ‚ÄúJob title, Skills‚Äù field and enter ‚ÄúBangalore‚Äù in ‚Äúenter the location‚Äù field. 
 3. Then click the searchbutton.  
 4. Then scrape the data for the first 10 jobs results you get.  
 5. Finally create a dataframe of the scraped data.

In [331]:
#initiate automated driver
driver=webdriver.Chrome()

In [332]:
#open shine website
driver.get('https://www.shine.com/')

In [335]:
# insert 'Data Analyst' in correct designation 
designation=driver.find_element(By.ID, 'id_q')
designation.send_keys('Data Analyst')

In [338]:
#click search button 
search=driver.find_element(By.CLASS_NAME, 'searchForm_btnWrap_advance__VYBHN')
search.click()

In [351]:
#create list object for each detail
job_title=[]
company_name=[]
experience_required=[]
job_location=[]

In [352]:
# scrap job title, company name, experience required and location of job
title_tags=driver.find_elements(By.XPATH, "//strong[@class='jobCard_pReplaceH2__xWmHg']")
for title in title_tags:
    title=title.text
    job_title.append(title)
    
    
company_tag=driver.find_elements(By.XPATH, "//div[@class='jobCard_jobCard_cName__mYnow']")
for company in company_tag:
    company=company.text
    company_name.append(company)
    
    
experience_tag=driver.find_elements(By.XPATH, "//div[@class=' jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t']")
for experience in experience_tag:
    experience=experience.text
    experience_required.append(experience)
    

location_tag=driver.find_elements(By.XPATH, "//div[@class=' jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2']")
for location in location_tag:
    location=location.text
    job_location.append(location)

In [353]:
#print length to confirm dataframe can be made 
print(len(job_title), len(company_name), len(experience_required), len(job_location))

20 20 20 20

In [354]:
#create dataframe and correct index
df_2=pd.DataFrame({'Job Title': job_title, 'Company': company_name, 'Experience': experience_required, 'Location': job_location})[:10]
df_2.index=df_2.index + 1
df_2

,Job Title,Company,Experience,Location
1,Data Analyst (New Delhi),valocity,3 to 7 Yrs,All India
2,Data Analyst,novartis,2 to 6 Yrs,Hyderabad\n+1
3,Data Analyst,ajax media tech,2 to 6 Yrs,Chennai\n+1
4,Data Analyst,techmash software solutions pvt ltd,4 to 8 Yrs,All India
5,Data Analyst,toolyt,2 to 6 Yrs,Jaipur\n+1
6,Data Analyst,regency group,2 to 6 Yrs,Kozhikode\n+1
7,Business Data Analyst (Sr Exe / Asst Manager),talent leads hr solutions,3 to 7 Yrs,Other Karnataka
8,Data Analyst Intern,universal printers,0 to 4 Yrs,Other Maharashtra\n+1
9,Data Analyst,bunge,6 to 10 Yrs,Other Punjab
10,Senior Data Analyst,donorbox,4 to 8 Yrs,All India

__________________________________________

Q3: Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link: https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART

In [642]:
#initiate webdriver
driver=webdriver.Chrome()

In [643]:
# open flipkart in automated chrome
driver.get('https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART')

In [645]:
#create lists for each object 
product_rating=[]
review_summary=[]
full_review=[]

In [646]:
#iterate through pages 1 to 10
for page in range (1,11,1):
    #load page and page number accordingly  
    driver.get(f'https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART{page}')

#find rating, summary and review
    rating_tags=driver.find_elements(By.XPATH, "//div[@class='XQDdHH Ga3i8K']")
    summary_tags=driver.find_elements(By.XPATH, "//p[@class='z9E0IG']")
    review_tags=driver.find_elements(By.XPATH, "//div[@class='ZmyHeo']")
    
#iterate throught range of pages by length of rating_tags    
    for i in range(len(rating_tags)):
#append text for each detail        
        product_rating.append(rating_tags[i].text)
        review_summary.append(summary_tags[i].text)
        full_review.append(review_tags[i].text)
#print length to confirm all the same length in order to create dataframe 
print(len(product_rating), len(review_summary), len(full_review))

100 100 100

In [647]:
# create dataframe and correct index accordingly
df_3=pd.DataFrame({'Rating': product_rating, 'Summary': review_summary, 'Full Review': full_review})
df_3.index=df_3.index + 1
df_3

,Rating,Summary,Full Review
1,5,Classy product,Camera is awesome\nBest battery backup\nA perf...
2,5,Terrific,Very very good
3,5,Wonderful,This is amazing at all
4,5,Worth every penny,Feeling awesome after getting the delivery of ...
5,5,Best in the market!,Good Camera
...,...,...,...
96,5,Terrific purchase,Value for money üòç
97,5,Perfect product!,Photos super
98,5,Perfect product!,V Good all
99,5,Just wow!,Perfect Product!!
100,5,Excellent,NYC

Q4: Scrape data for first 100 sneakers you find when you visit flipkart.com and search for ‚Äúsneakers‚Äù in the search field.

In [604]:
#initate automated chrome
driver=webdriver.Chrome()

In [605]:
#open flipkart webpage
driver.get('https://www.flipkart.com')

In [606]:
#enter 'sneakers' in designation
designation_4=driver.find_element(By.CLASS_NAME, 'Pke_EE')
designation_4.send_keys('sneakers')

In [607]:
#click search button to initiate search
search_4=driver.find_element(By.CLASS_NAME, '_2iLD__')
search_4.click()

In [616]:
# create list for elach detail
brand_name=[]
product_description=[]
product_price=[]

In [617]:
# iterate through pages 1 to 3
for page in range (1,4,1):
    #load page 
    driver.get(f'https://www.flipkart.com/search?q=sneakers&otracker=search&otracker1=search&marketplace=FLIPKART&as-show=on&as=off{page}')

#find and scrap brand, description and price
    name_tags=driver.find_elements(By.XPATH, "//div[@class='syl9yP']")
    description_tags=driver.find_elements(By.CLASS_NAME, "WKTcLC")
    price_tags=driver.find_elements(By.XPATH, "//div[@class='Nx9bqj']")
    
 #   iterate throught range of pages by length of name_tags
    for i in range(len(name_tags)):
#append text for each         
        brand_name.append(name_tags[i].text)
        product_description.append(description_tags[i].text)
        product_price.append(price_tags[i].text)
 

 
#print length of details to confirm equal lengths and to create dataframe 
print(len(brand_name), len(product_description), len(product_price))

120 120 120

In [618]:
#create data frame and correct indec accordingly 
df_4=pd.DataFrame({'Brand':brand_name, 'Description': product_description, 'Price': product_price })[:100]
df_4.index=df_4.index + 1
df_4

        Brand                                        Description   Price
1      BRUTON                 Lite Casual Shoes Sneakers For Men    ‚Çπ479
2      BRUTON             2 Combo Sneaker Shoes Sneakers For Men    ‚Çπ470
3    URBANBOX  Trending Stylish Casual Outdoor Shoes Sneakers...    ‚Çπ299
4    RED TAPE  Casual Sneakers Shoes for Men | Soft Cushioned...  ‚Çπ1,179
5    RED TAPE  Casual Sneaker Shoes for Men | Classic Rounded...  ‚Çπ1,099
..        ...                                                ...     ...
96   RED TAPE  Casual Sneaker Shoes For Men | Enhanced Comfor...  ‚Çπ1,119
97     Labbin  Casual Sneakers ColourFul Block Shoes For Boys...    ‚Çπ649
98     Shozie  Stylish Walking Partywear Sneakers Casual Shoe...    ‚Çπ449
99   RED TAPE  Sneaker Casual Shoes For Men | Soft Cushion In...  ‚Çπ1,379
100     Knoos                                   Sneakers For Men    ‚Çπ799

[100 rows x 3 columns]

_______________________________

Q5: Go to webpage https://www.amazon.in/ Enter ‚ÄúLaptop‚Äù in the search field and then click the search icon.

In [442]:
#initiate webdriver 
driver=webdriver.Chrome()

In [443]:
# open amazon.in in automated chrome 
driver.get('https://www.amazon.in/')

In [444]:
# add 'laptop' to search designation
designation_5=driver.find_element(By.ID, 'twotabsearchtextbox')
designation_5.send_keys('Laptop')

In [445]:
#click search  button 
search_5=driver.find_element(By.ID, 'nav-search-submit-button')
search_5.click()

In [447]:
# check 'core i7' filter to initiate specific search
check_box5=driver.find_element(By.XPATH, "//li[@id='p_n_feature_thirteen_browse-bin/12598163031']/span/a/div")
check_box5.click()

In [475]:
# create list objects for each detail
title_5=[]
ratings_5=[]
price_5=[]

In [476]:
# scrap title, rating and price for laptops on this page
title_tags=driver.find_elements(By.XPATH, "//h2[@class='a-size-mini a-spacing-none a-color-base s-line-clamp-2']")
for i in title_tags:
    title=i.text
    title_5.append(title)
                                 


ratings_tags=driver.find_elements(By.XPATH, "//a[@class='a-popover-trigger a-declarative']")
for i in ratings_tags:
    ratings=i.text
    ratings_5.append(ratings)
    
    

price_tags=driver.find_elements(By.XPATH, "//div[@class='a-row a-size-small']")
for i in price_tags:
    price=i.text
    price_5.append(price)

In [477]:
#print length to confirm all the same to create dataframe
print(len(title_5), len(ratings_5), len(price_5))

24 24 24

In [478]:
#create data frame, correct index accordingly and make sure to slice to first ten laptops
df_5=pd.DataFrame({'Title':title_5, 'Rating': ratings_5, 'Price': price_5})[:10]
df_5.index=df_5.index + 1
df_5

                                                Title Rating Price
1   Dell Inspiron 7420 2in1 Laptop, Intel Core i7-...           69
2   Acer Aspire Lite 12th Gen Intel Core i7-1255U ...          391
3   ASUS Vivobook 15, Intel Core i7-12650H 12th Ge...          244
4   MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...            4
5   Lenovo IdeaPad Slim 3 Intel Core i7 11th Gen 1...          108
6   HP Laptop 15s, 12th Gen Intel Core i7-1255U, 1...          492
7   HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...           59
8   ASUS TUF Gaming F15, 15.6"(39.62 cms) FHD 144H...          693
9   Acer Travelmate Business Laptop Intel Core i7-...          285
10  HP Victus Gaming Laptop, 12th Gen Intel Core i...           34

______________

Q6: Write a python program to scrape data for Top 1000 Quotes of All Time. 
The above task will be done in following steps: 
1. First get the webpagehttps://www.azquotes.com/  2. Click on Top Quote 3. Than scrap a) Quote b) Author c) Type Of Quotes

In [588]:
#initiate webdriver
driver=webdriver.Chrome()

In [589]:
# open azquotes in automated Chrome
driver.get('https://www.azquotes.com/')

In [590]:
#click 'top qoutes' to go to webpage
click_6=driver.find_element(By.XPATH, '//a[@href="/top_quotes.html"]')
click_6.click()

In [601]:
#create lists of details to be scraped
quote_=[]
author_=[]
quote_type=[]

In [602]:
#iterate through pages 1 to 10 
for page in range (1,11,1):
    #load page 
    driver.get(f'http://www.azquotes.com/top_quotes.html{page}')

    
#find details to scrap
    quote_tags=driver.find_elements(By.XPATH, '//a[@class="title"]')
    author_tags=driver.find_elements(By.XPATH, '//div[@class="author"]')
    type_tags=driver.find_elements(By.XPATH, '//div[@class="tags"]')
    
    
#iterate through range of pages by length of quote_tags   
    for i in range(len(quote_tags)):
#append text for each 
        quote_.append(quote_tags[i].text)
        author_.append(author_tags[i].text)
        quote_type.append(type_tags[i].text)

        
#print length of each detail to confirm the same and create dataframe
print(len(quote_), len(author_), len(quote_type))

1000 1000 1000

In [603]:
#create dataframe and correct index accordingly
df_6a=pd.DataFrame({'Quote':quote_, 'Author': author_, 'Type of Quote': quote_type })
df_6a.index=df_6a.index + 1
df_6a

,Quote,Author,Type of Quote
1,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
2,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
3,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
4,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
5,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
996,"When the going gets weird, the weird turn pro.",Hunter S. Thompson,"Music, Sports, Hunting"
997,When a train goes through a tunnel and it gets...,Corrie Ten Boom,"Trust, Encouraging, Uplifting"
998,If you think you are too small to make a diffe...,Dalai Lama,"Inspirational, Funny, Change"
999,"God doesn't require us to succeed, he only req...",Mother Teresa,"Success, God, Mother"
1000,Change your thoughts and you change your world.,Norman Vincent Peale,"Inspirational, Motivational, Change"

____________________

Q7: Write a python program to display list of respected former Prime Ministers of India (i.e. Name, Born-Dead, Term of office, Remarks) from https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1  
 
 scrap the mentioned data and make the DataFrame

In [299]:
#initiate webdriver 
driver=webdriver.Chrome()

In [300]:
#open 'jagranjosh' website in automated Chrome
driver.get('https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1')

In [325]:
#create list for each detail
PM_name=[]
born_dead=[]
office_term=[]
remark_=[]

In [326]:
#scrap each detail from the table 
name_tags=driver.find_elements(By.XPATH, "//div[@class='TableData']//tbody/tr/td[2]/div")
for i in name_tags:
    name=i.text
    PM_name.append(name)
    

born_tags=driver.find_elements(By.XPATH, "//div[@class='TableData']//tbody/tr/td[3]")
for i in born_tags:
    born=i.text
    born_dead.append(born)
    
    

term_tags=driver.find_elements(By.XPATH, "//div[@class='TableData']//tbody/tr/td[4]")
for i in term_tags:
    term=i.text
    office_term.append(term)
    
    

remark_tags=driver.find_elements(By.XPATH, "//div[@class='TableData']//tbody/tr/td[5]")
for i in remark_tags:
    remark=i.text
    remark_.append(remark)

In [327]:
#printe length of each detail to confirm the smae in order to create dataframe
print(len(PM_name), len(born_dead), len(office_term), len(remark_))

19 19 19 19

In [329]:
#create data from and correct index
df_7=pd.DataFrame({'Priminster Name': PM_name, 'Born-Dead': born_dead, 'Term in Office':office_term, 'Remark':remark_})
df_7.index=df_7.index + 1
df_7

,Priminster Name,Born-Dead,Term in Office,Remark
1,Jawahar Lal Nehru,(1889‚Äì1964),"15 August 1947 to 27 May 1964\n16 years, 286 days",The first prime minister of India and the long...
2,Gulzarilal Nanda (Acting),(1898-1998),"27 May 1964 to 9 June 1964,\n13 days",First acting PM of India
3,Lal Bahadur Shastri,(1904‚Äì1966),"9 June 1964 to 11 January 1966\n1 year, 216 days",He has given the slogan of 'Jai Jawan Jai Kisa...
4,Gulzari Lal Nanda (Acting),(1898-1998),11 January 1966 to 24 January 1966\n13 days,-
5,Indira Gandhi,(1917‚Äì1984),"24 January 1966 to 24 March 1977\n11 years, 59...",First female Prime Minister of India
6,Morarji Desai,(1896‚Äì1995),"24 March 1977 to 28 July 1979 \n2 year, 126 days",Oldest to become PM (81 years old) and first t...
7,Charan Singh,(1902‚Äì1987),28 July 1979 to 14 January 1980\n170 days,Only PM who did not face the Parliament
8,Indira Gandhi,(1917‚Äì1984),"14 January 1980 to 31 October 1984\n4 years, 2...",The first lady who served as PM for the second...
9,Rajiv Gandhi,(1944‚Äì1991),"31 October 1984 to 2 December 1989\n5 years, 3...",Youngest to become PM (40 years old)
10,V. P. Singh,(1931‚Äì2008),2 December 1989 to 10 November 1990\n343 days,First PM to step down after a vote of no confi...
11,Chandra Shekhar,(1927‚Äì2007),10 November 1990 to 21 June 1991\n223 days,He belongs to Samajwadi Janata Party
12,P. V. Narasimha Rao,(1921‚Äì2004),"21 June 1991 to 16 May 1996\n4 years, 330 days",First PM from South India
13,Atal Bihari Vajpayee,(1924- 2018),16 May 1996 to 1 June 1996\n16 days,PM for shortest tenure
14,H. D. Deve Gowda,(born 1933),1 June 1996 to 21 April 1997\n324 days,He belongs to Janata Dal
15,Inder Kumar Gujral,(1919‚Äì2012),21 April 1997 to 19 March 1998 \n332 days,------
16,Atal Bihari Vajpayee,(1924-2018),"19 March 1998 to 22 May 2004 \n6 years, 64 days",The first non-congress PM who completed a ful...
17,Manmohan Singh,(born 1932),"22 May 2004 to 26 May 2014 \n10 years, 4 days",First Sikh PM
18,Narendra Modi,(born 1950),26 May 2014 - 2019,4th Prime Minister of India who served two con...
19,Narendra Modi,(born 1950),30 May 2019- Incumbent,First non-congress PM with two consecutive ten...

________________________

Q8: Write a python program to display list of 50 Most expensive cars in the world (i.e. Car name and Price) from https://www.motor1.com/  
 
 
This task will be done in following steps: 
1. First get the webpage https://www.motor1.com/ 2. Then You have to type in the search bar ‚Äô50 most expensive cars‚Äô 3. Then click on 50 most expensive cars in the world.. 4. Then scrap the mentioned data and make the dataframe.

In [680]:
#initiate webdriver
driver=webdriver.Chrome()

In [681]:
#open webpage in automated Chrome
driver.get('https://www.motor1.com/')

CHANGED 50 TO 20 AS IT DIDNT APPEAR

In [683]:
#insert '20 most expensive cars in the world' in designation box
designation_8=driver.find_element(By.ID, "search_input")
designation_8.send_keys('20 most expensive cars in the world')

In [684]:
#click search button to find article
search_8=driver.find_element(By.XPATH, "//button[@class='m1-search-panel-button m1-search-form-button-animate icon-search-svg']")
search_8.click()

In [685]:
#click article to open 
search_link=driver.find_element(By.XPATH, "//h3/a")
search_link.click()

In [698]:
#create lists for each detail
car_name=[]
car_price=[]

In [699]:
#scrap name and price 
name_tags=driver.find_elements(By.XPATH, "//h3[@class='subheader']")
for i in name_tags:
    name=i.text
    car_name.append(name)
    
#
price_tags=driver.find_elements(By.XPATH, "//p/strong")
for i in price_tags:
    price=i.text
    car_price.append(price)

In [700]:
#print length fo each to confirm the same and create dataframe
print(len(car_name), len(car_price))

22 22

________________________________________________

THERE IS AN ERROR IN THE PRICE LIST, THE 3RD PRICE IS EMPTY AND CONTINUES CORRECTLY ONWARDS BUT IN THE WRONG PLACE.

In [689]:
#create dataframe and correct index accordingly
df_8=pd.DataFrame({'Name': car_name, 'Price': car_price})[:21]
df_8.index=df_8.index + 1 
df_8

                               Name                                 Price
1                 Ferrari LaFerrari    Price: ¬£1.1 million ($1.4 million)
2                     Pagani Huayra    Price: ¬£1.1 million ($1.4 million)
3                      McLaren Elva
4                     Ferrari Monza    Price: ¬£1.3 million ($1.7 million)
5                   Bentley Bacalar    Price: ¬£1.3 million ($1.7 million)
6              Pininfarina Battista    Price: ¬£1.5 million ($1.9 million)
7          Mercedes-AMG Project One    Price: ¬£1.9 million ($2.5 million)
8               Aston Martin Victor    Price: ¬£2.1 million ($2.7 million)
9                    Bugatti Bolide    Price: ¬£2.3 million ($3.0 million)
10            Aston Martin Valkyrie    Price: ¬£2.3 million ($3.0 million)
11        W Motors Lykan Hypersport   Price: ¬£2.5 million* ($3.2 million)
12        Pagani Huayra Roadster BC    Price: ¬£2.6 million ($3.4 million)
13         Bugatti Chiron Pur Sport    Price: ¬£2.7 million ($3.5 million)
14                 Lamborghini Sian    Price: ¬£2.8 million ($3.6 million)
15  Bugatti Chiron Super Sport 300+    Price: ¬£2.8 million ($3.6 million)
16               Lamborghini Veneno    Price: ¬£3.0 million ($3.9 million)
17                     Bugatti Divo    Price: ¬£3.5 million ($4.5 million)
18         Mercedes-Maybach Exelero    Price: ¬£4.5 million ($5.8 million)
19               Bugatti Centodieci    Price: ¬£6.1 million ($8.0 million)
20         Bugatti La Voiture Noire    Price: ¬£6.9 million ($9.0 million)
21           Rolls-Royce Boat Tail*  Price: ¬£14.4 million ($18.7 million)

_______________________________

END OF ASSIGNMENT